app/controllers/sessions_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."uid" = ? AND "accounts"."provider" = ? LIMIT ?  [["uid", "16583"], ["provider", "vkontakte"], ["LIMIT", 1]]
INSERT INTO "accounts" ("uid", "provider", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uid", "16583"], ["provider", "vkontakte"], ["user_id", 1], ["created_at", 2016-12-08 19:37:19 UTC], ["updated_at", 2016-12-08 19:37:19 UTC]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "Vitalik_Drobot@mail.com"], ["created_at", 2016-12-08 19:37:19 UTC], ["updated_at", 2016-12-08 19:37:19 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Vitalik_Drobot@mail.com"], ["LIMIT", 1]]
---
	def create
		@account = Account.find_by(uid: auth_params['uid'], provider: auth_params['provider'])
		unless @account
			@account = Account.create(uid: auth_params['uid'], provider: auth_params['provider'],
										user: User.find_or_create_by(email: auth_params['info']['email']))